Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНДСПриИмпорте</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаАкциза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиАкциза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКПВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентРасчетаОблагаемойБазыАкциза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПодакцизногоТМЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодакцизныхТМЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСкважины</Name>
					<Comment>TS</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастокБурения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>си_ЯвляетсяСпецодеждойИнвентарем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>си_ОсновноеНазначениеИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.си_НазначенияИспользования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТовараЭСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностьУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсобенностиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНацКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТМЦ</Name>
					<Comment>Вид ТМЦ для сводного отчета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторВидовТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РаботаСНоменклатуройКлиентБК/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняет поиск номенклатуры по штрих-коду в регистре сведений "Штрихкоды" и в сервисе 1С:Номенклатура.
//
// Параметры:
//  Оповещение  - ОписаниеОповещения - Описание процедуры, принимающей результат поиска.
//
Процедура НайтиПоШтрихкоду(Оповещение) Экспорт
	
	Перем Штрихкод, ТекстВопроса;
	
	Оповещение.ДополнительныеПараметры.Свойство("Штрихкод", Штрихкод);
	Оповещение.ДополнительныеПараметры.Свойство("ТекстВопроса", ТекстВопроса);
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеОРезультате", Оповещение);
	Контекст.Вставить("ТекстВопроса", ТекстВопроса);
	
	Если ЗначениеЗаполнено(Штрихкод) Тогда
		ДанныеШтрихкода = Новый Структура("Штрихкод, Количество", Штрихкод, 0);
		ПоискНоменклатурыПоШтрихкодуПослеВводаСтроки(ДанныеШтрихкода, Контекст);
	Иначе
		ОповещениеПослеВводаСтроки = Новый ОписаниеОповещения("ПоискНоменклатурыПоШтрихкодуПослеВводаСтроки",
			ЭтотОбъект, Контекст);
		ПоказатьВводШтрихкода(ОповещениеПослеВводаСтроки);

	КонецЕсли;
	
КонецПроцедуры

Процедура ПоискНоменклатурыПоШтрихкодуПослеВводаСтроки(ДанныеШтрихкода, Контекст) Экспорт
	
	Штрихкод = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеШтрихкода, "Штрихкод");
	
	Если Штрихкод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контекст.Вставить("Штрихкод", Штрихкод);
	
	ШтрихкодСтруктура = Новый Структура("Штрихкод, Количество", "", 1);
	ШтрихкодСтруктура.Штрихкод = РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиентСервер.ШтрихкодВBase64(Штрихкод);
	ШтрихкодСтруктура.Вставить("ФорматBase64", Истина);
	
	НоменклатураПоШтрихкоду = РаботаСНоменклатуройВызовСервераБК.НоменклатураПоШтрихкоду(ШтрихкодСтруктура);
	Контекст.Вставить("Номенклатура", НоменклатураПоШтрихкоду);
	
	Если Не НоменклатураПоШтрихкоду.Пустая() Тогда
		ПоискНоменклатурыПоШтрихкодуЗавершение(Контекст);
	Иначе 
		
		ТекущийКод = РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиентСервер.ШтрихкодВBase64(Контекст.Штрихкод);
		РаботаСДокументамиИСМПТККлиентПереопределяемый.ПроверитьШтрихкод(ЭтотОбъект, ТекущийКод, Истина, Ложь, "Сервис");
		Если ТекущийКод = "" Тогда
			Возврат;
		КонецЕсли;
		
		ПроверитьДоступностьИВыполнитьПоиск(Контекст);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоискНоменклатурыПоШтрихкодуПослеДобавленияИзСервиса(Результат, Контекст) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		Контекст.Вставить("Идентификатор", Результат);
	Иначе 
		СозданнаяНоменклатура = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "СозданнаяНоменклатура");
		Если ТипЗнч(СозданнаяНоменклатура) = Тип("Массив") И СозданнаяНоменклатура.Количество() > 0 Тогда
			НоменклатураПоШтрихкоду = СозданнаяНоменклатура[0];
			Контекст.Вставить("Номенклатура", НоменклатураПоШтрихкоду);
		КонецЕсли;
	КонецЕсли;
	
	ПоискНоменклатурыПоШтрихкодуЗавершение(Контекст);
	
КонецПроцедуры

Процедура ПодключитьИнтернетПоддержкуПользователей(Оповещение) Экспорт
	
	ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(
		Оповещение, ЭтотОбъект);
	
КонецПроцедуры

// См. РаботаСНоменклатуройКлиентПереопределяемый.СоздатьНоменклатуруИнтерактивно.
Процедура СоздатьНоменклатуруИнтерактивно(ПараметрыФормы, ОписаниеОповещенияОЗакрытии) Экспорт 
	
	ПараметрыСоздания = Новый Структура;
	Если ПараметрыФормы.Свойство("ИдентификаторНоменклатуры") Тогда
		ПараметрыСоздания.Вставить("ИдентификаторСервиса", ПараметрыФормы.ИдентификаторНоменклатуры);
	КонецЕсли;
	
	Если ПараметрыСоздания.Количество() = 0 Тогда
		ПараметрыСоздания = ПараметрыФормы;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыСоздания,,,,, ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДоступностьИВыполнитьПоиск(Контекст)
	
	ПараметрыДоступности = РаботаСНоменклатуройКлиентСерверБК.ПараметрыДоступностиСервиса();
	
	Если ТипЗнч(Контекст.ОповещениеОРезультате.Модуль) = Тип("ФормаКлиентскогоПриложения") Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыДоступности, Контекст.ОповещениеОРезультате.Модуль);
	КонецЕсли;
	
	Если ПараметрыДоступности.ИнтернетПоддержкаПодключена = Неопределено Тогда
		РаботаСНоменклатуройВызовСервераБК.ЗаполнитьПараметрыДоступностиСервиса(ПараметрыДоступности);
	КонецЕсли;
	
	Для каждого Элемент Из ПараметрыДоступности Цикл
		Контекст.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Если Не ПараметрыДоступности.СервисДоступен Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нарушение прав доступа'"));
		ПоискНоменклатурыПоШтрихкодуЗавершение(Контекст);
	ИначеЕсли Не ПараметрыДоступности.СервисАктивен Тогда
		ТекстВопроса = Неопределено;
		Контекст.Свойство("ТекстВопроса", ТекстВопроса);
		Если ТекстВопроса = Неопределено Тогда
			ТекстВопроса = НСтр("ru = 'Хотите поискать в сервисе 1С:Номенклатура?'")
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ВопросВыполнитьПоискЗавершение", ЭтотОбъект, Контекст);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	ИначеЕсли Не ПараметрыДоступности.ИнтернетПоддержкаПодключена Тогда
		Оповещение = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержкуПользователейНажатиеПродолжение", 
			ЭтотОбъект, Контекст);
		ПодключитьИнтернетПоддержкуПользователей(Оповещение);
	Иначе 
		ВыполнитьПоиск(Контекст);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьПоиск(Контекст)
	
	Контекст.Вставить("ВернутьОдинРезультат", Истина);
	Оповещение = Новый ОписаниеОповещения("ПоискНоменклатурыПоШтрихкодуПослеДобавленияИзСервиса", ЭтотОбъект, Контекст);
	РаботаСНоменклатуройКлиент.НайтиНоменклатуруПоШтрихкодуВСервисе(Контекст.Штрихкод, Неопределено, Оповещение);
	
КонецПроцедуры

Процедура ПодключитьИнтернетПоддержкуПользователейНажатиеПродолжение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ИнтернетПоддержкаПодключена", Истина);
	ВыполнитьПоиск(ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ВопросВыполнитьПоискЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		ПоискНоменклатурыПоШтрихкодуЗавершение(ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	Если РаботаСНоменклатуройВызовСервераБК.СервисУспешноАктивирован() Тогда 
		ДополнительныеПараметры.Вставить("СервисАктивен", Истина);
	Иначе 
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось подключить сервис 1С:Номенклатура'"));
		ПоискНоменклатурыПоШтрихкодуЗавершение(ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ИнтернетПоддержкаПодключена Тогда
		ВыполнитьПоиск(ДополнительныеПараметры);
	Иначе 
		Оповещение = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержкуПользователейНажатиеПродолжение", 
			ЭтотОбъект, ДополнительныеПараметры);
		ПодключитьИнтернетПоддержкуПользователей(Оповещение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоискНоменклатурыПоШтрихкодуЗавершение(Контекст)
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	Результат.Вставить("Штрихкод", "");
	Результат.Вставить("Идентификатор", "");
	
	ЗаполнитьЗначенияСвойств(Результат, Контекст);
	
	Если Контекст.Свойство("ИнтернетПоддержкаПодключена") Тогда
		Результат.Вставить("ИнтернетПоддержкаПодключена", Контекст.ИнтернетПоддержкаПодключена);
	КонецЕсли;
	
	Если Контекст.Свойство("СервисАктивен") Тогда
		Результат.Вставить("СервисАктивен", Контекст.СервисАктивен);
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Контекст.ОповещениеОРезультате, Результат);
	
КонецПроцедуры  

// Процедура показывает ввод штрихкода и оповещает в случае успешного ввода
//
// Параметры:
//  ОповещениеУспешногоВвода - ОписаниеОповещения - описание оповещения успешного ввода штрихкода
//  Заголовок                - Строка             - переопределяемый загловок.
Процедура ПоказатьВводШтрихкода(ОповещениеУспешногоВвода, Количество = Неопределено, Заголовок = "") Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Заголовок) Тогда
		Заголовок = НСтр("ru = 'Введите штрихкод'");
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура(
		"ОповещениеУспешногоВвода, Количество",
		ОповещениеУспешногоВвода,
		Количество);
	Оповещение = Новый ОписаниеОповещения(
		"ПоказатьВводШтрихкодаЗавершение",
		ЭтотОбъект,
		ДополнительныеПараметры);
	ПоказатьВводЗначения(Оповещение, "", Заголовок);
	
КонецПроцедуры

Процедура ПоказатьВводШтрихкодаЗавершение(Штрихкод, ДополнительныеПараметры) Экспорт
	
	ОповещениеУспешногоВвода = ДополнительныеПараметры.ОповещениеУспешногоВвода;
	Количество = ДополнительныеПараметры.Количество;
	
	Если (Штрихкод <> Неопределено) Тогда
		Если Не ПустаяСтрока(Штрихкод) Тогда
			Если Количество = Неопределено Тогда
				Количество = 1;
			КонецЕсли;
			ВыполнитьОбработкуОповещения(
				ОповещениеУспешногоВвода,
				Новый Структура("Штрихкод, Количество", Штрихкод, Количество));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
